/******************************************************************************

                  版权所有 (C), 2013-2023, 深圳博思高科技有限公司

 ******************************************************************************
  文 件 名   : StorageRecord.h
  版 本 号   : 初稿
  作    者   :  
  生成日期   : 2020年3月18日
  最近修改   :
  功能描述   : StorageRecord.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2020年3月18日
    作    者   :  
    修改内容   : 创建文件

******************************************************************************/
#ifndef __STORAGERECORD_H__
#define __STORAGERECORD_H__

/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/
 
typedef struct {
    uint32_t start;                         
    uint32_t value;                         
} ADDR_STRU;



typedef struct 
{
    uint8_t callingMode;                            //呼梯方式     
    uint8_t callingTime;                            //呼梯时间
    uint8_t targetFloor;                            //目标楼层  
    uint8_t userId[USER_ID_LEN+1];                  //用户ID
    uint8_t cardNo[CARD_NO_LEN+1];                  //卡号
    uint8_t accessFloor[FLOOR_ARRAY_LEN];           //楼层权限   
    uint32_t crc32;                                 //结构体数据的校验值
    uint32_t len;                                   //结构体所有节点数据长度    
}STORAGERECORD_STRU;



#endif /* __STORAGERECORD_H__ */
